app/controllers/automoviles_controller.rb

SELECT "automoviles".* FROM "automoviles"
---
  def index
    @automoviles = Automovile.all

INSERT INTO "automoviles" ("model", "brand", "driverid", "alias", "created_at", "updated_at", "code") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["model", 23123], ["brand", "SADSA"], ["driverid", 342423], ["alias", "ANDOADN"], ["created_at", "2021-08-09 21:09:23.918665"], ["updated_at", "2021-08-09 21:09:23.918665"], ["code", "654789"]]
---
  def create
    @automovile = Automovile.new(automovile_params)

    respond_to do |format|
      if @automovile.save

DELETE FROM "automoviles" WHERE "automoviles"."id" = $1  [["id", 1]]
---
  def destroy
    @automovile.destroy

SELECT "automoviles".* FROM "automoviles" WHERE "automoviles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_automovile
      @automovile = Automovile.find(params[:id])