app/controllers/carros_controller.rb

SELECT "carros".* FROM "carros"
---
  def index
    @carros = Carro.all

INSERT INTO "carros" ("model", "brand", "driverid", "alias", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["model", 2000], ["brand", "Toyota"], ["driverid", 1], ["alias", "Ands"], ["created_at", "2021-08-07 20:19:17.016428"], ["updated_at", "2021-08-07 20:19:17.016428"]]
---
  def create
    @carro = Carro.new(carro_params)

    respond_to do |format|
      if @carro.save

SELECT "carros".* FROM "carros" WHERE "carros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_carro
      @carro = Carro.find(params[:id])