app/controllers/conductors_controller.rb

SELECT "conductors".* FROM "conductors"
---
  def index
    @conductors = Conductor.all