app/controllers/conductores_controller.rb

  def index
    @conductores = Conductore.all
---
SELECT "conductores".* FROM "conductores"

  def create
    @conductore = Conductore.new(conductore_params)

    respond_to do |format|
      if @conductore.save
---
INSERT INTO "conductores" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Andres"], ["created_at", "2021-08-06 16:47:16.706385"], ["updated_at", "2021-08-06 16:47:16.706385"]]

  def destroy
    @conductore.destroy
---
DELETE FROM "conductores" WHERE "conductores"."id" = $1  [["id", 17]]

    def set_conductore
      @conductore = Conductore.find(params[:id])
---
SELECT "conductores".* FROM "conductores" WHERE "conductores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]